DATA_BASE_PAGES_OF_BOOKS = [
    {
        img: "book-1.jpg",
        name: "Гаррі Поттер і прокляте дитя",
        autor: "Дж К Ролінг",
        binding: "Тверда",
        language: "Українська",
        publishingHouse: "А-ба-ба-га-ла-ма-га",
        numberOfPages: "350",
        translator: "Віктор Морозов",
        yearOfPublication: "2016",
        passage: "Син Гаррі Поттера Албус потрапляє на факультет «Слизерин», де заводить дружбу з сином Драко Мелфоя Скорпіусом. Він не вміє грати у квідич і часто свариться з батьком. На четвертому році навчання в Гоґвортсі Албус і Скорпіус вирішують змінити минуле за допомогою останнього маховика часу, щоб врятувати від смерті Седрика Діґорі, який загинув під час подій «Кубка Вогню». На це їх напоумила Делфі — таємна донька лорда Волдеморта і Белатріси Лестранж — яка хоче повернутися в минуле і захопити владу разом з батьком.",
    },

    {
        img: "book-2.jpg",
        name: "Маленький принц",
        autor: "Антуан де Сент-Екзюпері",
        binding: "Тверда",
        language: "Українська",
        publishingHouse: "КМ-БУКС",
        numberOfPages: "112",
        translator: "Марина Марченко",
        yearOfPublication: "2017",
        passage: "Пілот здійснює вимушену посадку в пустелі Сахара і зустрічає одного незвичайного та загадкового хлопчика — принца з іншої планети — астероїда B-612. Маленький принц розповідає про свої пригоди на Землі, говорить про дивовижну троянду, яку залишив на своїй малій планеті, про своє життя на астероїді, де є три вулкани. Він проводить час, приводячи до ладу свій астероїд, виполюючи баобаби, які намагаються глибоко прорости і заполонити всю планету. Маленький принц любить спостерігати заходи сонця, які на його малій планеті можна побачити скільки завгодно разів на день. Одного дня Маленький принц відлітає, щоб вивчити і пізнати інші місця Всесвіту. Відвідавши кілька інших астероїдів, він зустрічає багато дивних дорослих: короля, якому здається, що він править зірками; честолюбця, який хоче, щоб усі ним захоплювалися; п'яницю, який п'є, щоб забути, що йому соромно пити; ділову людину, яка постійно рахує зірки, бо думає, що володіє багатьма з них і хоче купити ще більше; ліхтарника, який, вірний своєму слову, кожну хвилину запалює і гасить ліхтар; географа, який записує в книгу розповіді мандрівників, але сам ніколи нікуди не подорожує. За порадою географа Маленький принц відвідує Землю, де, крім пілота, який зазнав аварії літака, зустрічає теж інших персонажів і, спілкуючись з ними, дізнається багато важливих речей.",

    },

    {
        img: "book-3.jpg",
        name: "1984",
        autor: "Джордж Орвелл",
        binding: "Тверда",
        language: "Українська",
        publishingHouse: "Видавництво Жупанського",
        numberOfPages: "312",
        translator: "Віктор Шовкун",
        yearOfPublication: "2015",
        passage: "Головний герой, Вінстон Сміт, живе в Лондоні, працює в Міністерстві Правди і є членом Зовнішньої Партії. Він не поділяє партійних ідеологій, і в глибині душі вельми сумнівається в партії, навколишній дійсності й узагалі в усьому тому, в чому тільки можна сумніватися. Щоб «випустити пару» і не зробити нерозважливого вчинку, він купує щоденник, в якому намагається викладати всі свої сумніви. Водночас на людях Вінстон намагається виглядати прихильником партійних ідей. Однак він побоюється, що дівчина Джулія, яка працює в тому ж міністерстві, шпигує за ним і хоче викрити його. Також він вважає, що високопосадовий співробітник їхнього міністерства, член Внутрішньої партії О'Браєн, так само не поділяє думки партії і є підпільним революціонером.",

    },

    {
        img: "book-4.png",
        name: "451° за Фаренгейтом",
        autor: "Рей Бредбері",
        binding: "Тверда",
        language: "Українська",
        publishingHouse: "Навчальна книга - Богдан",
        numberOfPages: "144",
        translator: "Євген Крижевич",
        yearOfPublication: "2018",
        passage: "Роман «451 градус за Фаренгейтом» розповідає про тоталітарне суспільство, в якому література заборонена, а пожежники повинні спалювати всі заборонені книги, які виявлять, разом з будинками. Власники книг при цьому підлягають арешту, одного з них навіть відправляють до психіатричної лікарні. Автор описав людей, які втратили зв'язок один з одним, з природою, з інтелектуальним спадком людства. Люди поспішають на роботу чи з роботи, ніколи не говорячи про те, що вони думають або відчувають, розмовляючи лише про безглузді дрібниці, захоплюючись тільки матеріальними цінностями. Удома вони оточують себе інтерактивним телебаченням, яке проектує зображення відразу на стіни (в які вбудовані кінескопи), і заповнюють свій вільний час переглядом телевізійних передач, нескінченних і безглуздих серіалів. Однак «щаслива», на перший погляд, держава перебуває на порозі тотальної руйнівної війни, якій все ж судилося розпочатися.",

    },

    
    {
        img: "book-5.jpg",
        name: "І не лишилось жодного",
        autor: "Агата Крісті",
        binding: "Тверда",
        language: "Українська",
        publishingHouse: "Книжковий клуб \"Клуб Сімейного Дозвілля\"",
        numberOfPages: "288",
        translator: "Надія Хаєцька",
        yearOfPublication: "2023",
        passage: "На Негритянський острів запрошено вісім людей, які не знають один одного. Вони з різних верств суспільства, різного віку. Кожен із них одержав листа від когось із давніх знайомих. На острові їх зустрічає сім'я гувернантів Роджерс. Вони розташовуються в будинку, чекаючи господарів, таємничих пана та пані Онім (в оригіналі Owen; разом з ініціалами це прізвище нагадує слово unknown, тобто невідомий; у деяких перекладах аналогічно фігурує слово анонім). У центрі столу стоїть таця із десятьма статуетками негренят. У кожного з гостей в кімнаті на стіні висить дитяча лічилка про десятьох негренят.",

    },

    {
        img: "book-6.jpg",
        name: "Тіні забутих предків",
        autor: "Михайло Коцюбинський",
        binding: "Тверда",
        language: "Українська",
        publishingHouse: "Фоліо",
        numberOfPages: "*",
        translator: "*",
        yearOfPublication: "2013",
        passage: "У селі біля річки Черемош ростуть двоє дітей, Іван та Марічка. Через відлюдькуватість та цікавість до чаклунства й нечистої сили мати Івана навіть вважала його одмінком. Коли йому виповнюється 7 років, одного разу, пасучи корів, Іван чує дивну пісню, хоча поряд немає людей. Згодом він дізнається про давню ворожнечу свого роду Палійчуків з Гутенюками, та стає свідком замаху на свого батька, від рани той за кілька днів помирає. Задля помсти він б'є Марічку, адже вона є дочкою вбивці, та викидає в річку її кісники. Вона хвалиться, що має кращі, Іван із заздрощів починає хвалитися сам і врешті діти забувають про образу.",

    },

    {
        img: "book-7.jpg",
        name: "Володар перснів. Частина 1. Братство персня",
        autor: "Джон Рональд Руел Толкін",
        binding: "Тверда",
        language: "Українська",
        publishingHouse: "Астролябія",
        numberOfPages: "704",
        translator: "Катерина Оніщук",
        yearOfPublication: "2022",
        passage: "На початку фільму показана історія Середзем'я: ельфи отримали три персні влади, гноми — сім, а люди — дев'ять. Один перстень темний володар Саурон таємно викував і залишив собі, щоб підкорити інших. Люди та ельфи зібрались в Останньому Союзі, щоб перемогти його. Їх армії зійшлися з арміями ворога біля Чорної Брами Мордора. Саурон вбив короля людей Еленділа, але його син Ісілдур зрубав уламком меча Перстень Всевладдя з руки Саурона, і цим його знищив. Перстень він залишив собі. Але одного разу він потрапив у засідку і був убитий, а Перстень опинився на дні річки. Там його через два з половиною тисячоліття знайшов Ґолум і володів ним 500 років, доки той його не покинув. Але Перстень не повернувся до свого володаря, а був знайдений гобітом Більбо Торбином. З ним він потрапив у Шир.",

    },

    {
        img: "book-8.jpg",
        name: "Кандід, або Оптимізм",
        autor: "Вольтер",
        binding: "М'яка",
        language: "Українська",
        publishingHouse: "Фоліо",
        numberOfPages: "128",
        translator: "М. Терещенко, Валер’ян Підмогильний",
        yearOfPublication: "2017",
        passage: "Твір являє Філософський роман з фантастичною складовою та нальотом абсурдизму і цинізму, книга «замаскована» під крутійський роман (форма перегукується з «Правдивими історіями» Лукіана). Герої твору — Кандид, його подруга Кунігунда і наставник Панглосс — колесять по всьому заселеному світі, стають свідками битв Семирічної війни, взяття росіянами Азова, Лісабонського землетрусу, і навіть відвідують казкову країну Ельдорадо. Цей утопічний роман вплинув на багатьох більш пізніх авторів утопічної та сатиричної фантастики — Олдаса Гакслі, Курта Воннегута та Роберта Шеклі.",

    },

    {
        img: "book-9.jpg",
        name: "Країна імли",
        autor: "Артур Конан Дойл",
        binding: "Тверда",
        language: "Українська",
        publishingHouse: "Фоліо",
        numberOfPages: "384",
        translator: "Євген Тарнавський",
        yearOfPublication: "2020",
        passage: "Молоді журналісти Едвард Мелоун та Енід Челленджер, донька знаменитого професора, потрапляють на зібрання спіритуалістів — людей, які нібито спілкуються із потойбічним світом, де стають свідками загадкових подій. Незважаючи на своє від самого початку скептичне ставлення до цього питання, Мелоун поступово проймається ідеями спіритуалізму і намагається розповісти про це світові. Однак несподівана перешкода в особі професора Челленджера, завзятого матеріаліста й адепта науки, руйнує його плани...",

    },

    {
        img: "book-10.jpg",
        name: "Талісман",
        autor: "Стівен Кінг",
        binding: "Тверда",
        language: "Українська",
        publishingHouse: "Книжковий клуб \"Клуб Сімейного Дозвілля\"",
        numberOfPages: "800",
        translator: "Анатолій Пітик, Катерина Грицайчук",
        yearOfPublication: "2016",
        passage: "Території — містичне місце, де кожна людина має Двійника. Саме туди прямує Джек, хлопчисько, який прагне знайти загадковий Талісман, щоб зберегти життя власної матері. Проте на Територіях вона є могутньою Королевою, про що хлопець тим часом не знає. Неймовірні пригоди, жахи, небезпека, магія перевтілення — усе це трапиться в нього на шляху. Але що ж коїтиметься в реальному світі, доки хлопчина виконуватиме своє завдання? Чи встигне він врятувати матір і чи не втратить себе при цьому?",

    },

]

